package main

func isPalindrome(x int) bool {

	if x < 0 || x != 0 && x%10 == 0 {
		return false
	}

	half := 0
	for x > half {
		half = half*10 + x%10
		x = x / 10
	}

	return x == half || x == half/10

}

// func main() {
// 	x := 202
// 	fmt.Println(isPalindrome(x))
// }

// x = 123321
// как можно посчитать половину числа?
// half = half * 10 + x % 10
// half := 0
// 1) 0 = 0 * 10 + 1
// 2) 1 = 1 * 10 + 2
// 3) 12 = 12 * 10 + 3
// итого мы собрали половину 123, но как узнать что это половина от x?
// x = x / 10
// 1) 123321 = 123321 / 10
// 2) 12332 = 12332 / 10
// 3) 1233 = 12332 / 10
// итого мы получили 123, остаётся только сравнить два этих числа между собой и выести результат
